"""
Студент: Шурыгин Д.Д.
Группа: 22ПТ2
"""

def detectNameFr(fullNames):
    names = list(map(lambda fullName: fullName.split()[1], fullNames))
    namesFr = {name:names.count(name) for name in set(names)}
    lowLimit, upLimit = 1, max(namesFr.values())
    result = ([], [])
    for name, count in namesFr.items():
        if( count == lowLimit ):
            result[0].append(name)
        if( count == upLimit ):
            result[1].append(name)
    return result

stud_list = ['Асаян Аркадий Вадимович', 'Борисов Дмитрий Евгеньевич', 'Быстров Александр Михайлович', 'Васильев Даниил Дмитриевич', 'Водолазов Даниил Сергеевич', 'Гарынов Даниил Дмитриевич', 'Глебов Илья Дмитриевич', 'Гусев Данила Александрович', 'Ивин Дмитрий Эдуардович', 'Карамышев Илья Андреевич', 'Каратаева Мария Александровна', 'Кондратьев Кирилл Максимович', 'Краснов Павел Денисович', 'Кузьмин Захар Дмитриевич', 'Кукушкин Владислав Валерьевич', 'Маслов Сергей Александрович', 'Мачалихин Данила Алексеевич', 'Нефедова Виктория Андреевна', 'Пономарев Вадим Алексеевич', 'Попов Максим Сергеевич', 'Родионова Алина Александровна', 'Сергеева Софья Владиславовна', 'Соколенко Никита Сергеевич', 'Фейгина Екатерина Андреевна', 'Хемчян Артур Тигранович', 'Юлгушев Рамиль Джаруллович', 'Юртаев Вадим Игоревич', 'Абазин Дмитрий Васильевич', 'Бойцов Иван Александрович', 'Болдов Сергей Дмитриевич', 'Воронин Никита Александрович', 'Горбачев Данила Александрович', 'Ермолаев Павел Юрьевич', 'Ефимов Павел Владимирович', 'Кабанов Данил Александрович', 'Ковалев Данил Евгеньевич', 'Конкин Александр Вадимович', 'Куничкин Иван Максимович', 'Нефедов Артём Алексеевич', 'Павлов Егор Андреевич', 'Прохоров Артем Сергеевич', 'Симонов Артем Николаевич', 'Акчурин Рахим Кадимович', 'Бузин Андрей Юрьевич', 'Галкин Кирилл Андреевич', 'Горбунов Данила Сергеевич', 'Губарев Вячеслав Андреевич', 'Егоркина Алёна Сергеевна', 'Ивашкин Алексей Геннадьевич', 'Коновалов Кирилл Андреевич', 'Кувшинов Максим Вячеславович', 'Назаров Егор Витальевич', 'Нафтаев Евгений Павлович', 'Павлов Иван Витальевич', 'Присяжный Андрей Юрьевич', 'Ревин Дмитрий Константинович', 'Рогашевский Александр Владиславович', 'Рудкевич Антон Максимович', 'Семов Илья Сергеевич', 'Удалов Дмитрий Анатольевич', 'Участкин Илья Александрович', 'Чекураев Даниил Денисович', 'Шепталин Вадим Сергеевич', 'Шматков Никита Сергеевич', 'Юдин Николай Михайлович', 'Воронов Максим Александрович', 'Губин Александр Андреевич', 'Денисов Андрей Викторович', 'Дубинин Никита Николаевич', 'Кололейкин Павел Анатольевич', 'Котунов Андрей Алексеевич', 'Кузнецов Никита Витальевич', 'Кулаков Иван Сергеевич', 'Пицан Антон Павлович', 'Пономарёв Никита Валерьевич', 'Резаев Михаил Константинович', 'Сапрыкин Дмитрий Евгеньевич', 'Сергиенко Иван Игоревич', 'Силантьев Сергей Александрович', 'Тарасов Иван Андреевич']

print(detectNameFr(stud_list))
